#+TITLE: ob-ts-node Integration Tests

* Basic Execution
#+NAME: basic
#+BEGIN_SRC typescript
console.log("Basic Execution");
#+END_SRC
#+RESULTS: basic
: Basic Execution

* Type System
#+NAME: types
#+BEGIN_SRC typescript
interface User {
  name: string;
  id: number;
}
const user: User = { name: "Alice", id: 1 };
console.log(`${user.name}:${user.id}`);
#+END_SRC
#+RESULTS: types
: Alice:1

* CLI Args (Skip Project)
#+NAME: skip-project
#+BEGIN_SRC typescript :cli-args "--skip-project --compiler-options '{\"module\":\"commonjs\"}'"
console.log("Skipped Project");
#+END_SRC
#+RESULTS: skip-project
: Skipped Project

* CLI Command (Bun)
#+NAME: bun
#+BEGIN_SRC typescript :cli-cmd "bun run"
console.log("Bun Run");
#+END_SRC
#+RESULTS: bun
: Bun Run
